march/weekSix/Sandwichr/app/controllers/ingredients_controller.rb

INSERT INTO "ingredients" ("name", "calories", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "mayonaise"], ["calories", 0], ["created_at", "2016-05-02 16:48:36.314682"], ["updated_at", "2016-05-02 16:48:36.314682"]]
---
	def create
		ingredients = Ingredient.create(ingredient_params)

SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		ingredients = Ingredient.where(id: params[:id])

SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "ingredients" WHERE "ingredients"."id" = ?  [["id", 2]]
---
	def destroy
		ingredients = Ingredient.find_by(id: params[:id])
		if ingredients.nil?
			render json: {error: "ingredient not found"},
				status: 404
				return
		end

		ingredients.destroy