march/weekSix/Sandwichr/app/controllers/sandwiches_controller.rb

	def create
		sandwich = Sandwich.create(sandwich_params)
---
INSERT INTO "sandwiches" ("name", "bread_type", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Club"], ["bread_type", "rye"], ["created_at", "2016-05-02 17:34:36.569873"], ["updated_at", "2016-05-02 17:34:36.569873"]]

	def destroy
		sandwich = Sandwich.find_by(id: params[:id])
		if sandwich.nil?
			render json: {error: "sandwich not found"}, status: 404
			return
		end

		sandwich.destroy
---
SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "sandwiches" WHERE "sandwiches"."id" = ?  [["id", 1]]